// Задача: Вывести квадрат числа
Console.Write("Введите число: ");
string numberA = Console.ReadLine();
int number = int.Parse(numberA);
Console.WriteLine("Квадрат числа: " + number * number);