// Даны два числа. Показать большее и меньшее число.

int number1 = 35;
int number2 = 53;
 if (number1 > number2)
 {
     Console.WriteLine("Большее число: " + number1);
     Console.WriteLine("Меньшее число: " + number2);
 }
 else
 {
     Console.WriteLine("Меньшее число: " + number1);
     Console.WriteLine("Большее число: " + number2);
 }